#pragma once

/// <summary>
/// ExperimentalParam
/// 実験条件をまとめた構造体、本シミュレーションのパラメータはすべてここで管理する。
/// 物理定数や、システム上の変数はここでは扱わない
/// </summary>
struct ExperimentalParam {
	int voltexNum;		//ボルテックスの数
	int piningSiteNum;	//ピニングサイトの数

};

struct SystemParam {
	const float dt = 0.01f;		//時間変化量
	const int height = 10;		//シミュレーションボックスの高さ
	const int weight = 10;		//シミュレーションボックスの幅
};

/// <summary>
/// 分子動力学法のマネージャークラス、各ボルテックス、ピニングサイトの管理をする
/// ボルテックス、ピニングサイトの初期条件を決め、コンストラクタでインスタンスを生成するし、
/// デストラクタでインスタンスを削除する
/// </summary>
class MD{
public:
	//=======================================================================================
	// public variables.
	//=======================================================================================
	/* NOTHING */

	//=======================================================================================
	// public methods.
	//=======================================================================================
	MD();			//必要なボルテックス、ピニングサイトのインスタンスを生成する
	~MD();			//インスタンスを削除する
	void Run();		//分子動力学法の実行

private:
	//=======================================================================================
	// private variables.
	//=======================================================================================
	ExperimentalParam params;
	Voltex* voltexs;		//ボルテックスのインスタンス、voltexNum個の配列として扱う

	//=======================================================================================
	// private methods.
	//=======================================================================================
	void InitVolPos();		//ボルテックスの初期配置を行う
};

